## HUDM 5199 - Spring 2022

## Yutong Shen, ys3453

## HW7 - March 31, 2022

## Session 9

### 1.1 pandas Series

**Creating a Series with Default Indices**

In [1]:
import pandas as pd

In [2]:
grades = pd.Series([87, 100, 94])

**Creating a Series with All Elements Having the Same Value**

In [3]:
pd.Series(98.6, range(3))

0    98.6
1    98.6
2    98.6
dtype: float64

In [4]:
pd.Series(98.6, ['grade1', 'grade2', 'grade3'])

grade1    98.6
grade2    98.6
grade3    98.6
dtype: float64

**Accessing a Series's Elements**

In [6]:
grades = pd.Series([87, 100, 94])
grades

0     87
1    100
2     94
dtype: int64

In [7]:
grades[0]

87

**Producing Descriptive Statistics for a Series**

In [8]:
grades.count()

3

In [9]:
grades.mean()

93.66666666666667

In [10]:
grades.min()

87

In [11]:
grades.max()

100

In [12]:
grades.std()

6.506407098647712

In [13]:
grades.describe()

count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

**Creating a Series with Custom Indices**

In [14]:
grades = pd.Series([87, 100, 94], index=['Wally', 'Eva', 'Sam'])

In [15]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

**Dictionary Initializers**

In [16]:
grades = pd.Series({'Wally': 87, 'Eva': 100, 'Sam': 94})

In [17]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

**Accessing Elements of a Series Via Custom Indices**

In [18]:
grades['Eva']

100

In [19]:
grades.Wally

87

In [20]:
grades.dtype # return the underlying array's element type

dtype('int64')

In [21]:
grades.values # return the underlying array

array([ 87, 100,  94])

**Creating a Series of Strings**

In [22]:
hardware = pd.Series(['Hammer', 'Saw', 'Wrench'])

In [23]:
hardware

0    Hammer
1       Saw
2    Wrench
dtype: object

In [25]:
hardware.str.contains('a')

0     True
1     True
2    False
dtype: bool

In [26]:
hardware.str.upper()

0    HAMMER
1       SAW
2    WRENCH
dtype: object

### 1.2 DataFrames

* Enhanced two-dimensional **array**
* Each column in a **DataFrame** is a **Series**

**Creating a DataFrame from a Dictionary**

In [27]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 
               'Bob': [83, 65, 85]}

In [28]:
grades = pd.DataFrame(grades_dict)

In [29]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

**Customizing a DataFrame's Indices with the Index Attribute**

In [30]:
grades.index = ['Test1', 'Test2', 'Test3']

In [31]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

**Accessing a DataFrame's Columns**

In [32]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [33]:
grades.Sam # Sam is valid python identifiers

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

**Selecting Rows via the loc and iloc Attributes**

In [34]:
grades.loc['Test1'] # specify which row you want to get

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [35]:
grades.iloc[1] # specify index of the row you want to get

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test2, dtype: int64

**Selecting Rows via Slices and Lists with the loc and iloc Attributes**

In [36]:
grades.loc['Test1':'Test3']

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [38]:
grades.loc[['Test1','Test3']]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

In [39]:
grades.iloc[0:2]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65

In [40]:
grades.iloc[[0, 2]]

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test3     70   90   90     82   85

**Selecting Subsets of the Rows and Columns**

In [42]:
grades.loc['Test1':'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [43]:
grades.iloc[[0, 2], 0:3]

       Wally  Eva  Sam
Test1     87  100   94
Test3     70   90   90

**What about if I want to get Sam, Katie, and Bob's Test2 and Test3?**

In [47]:
grades.loc['Test2':'Test3', ['Sam', 'Katie', 'Bob']]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [46]:
grades.iloc[[1, 2], 2:5]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [48]:
grades.loc['Test2':'Test3', 'Sam':'Bob']

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [49]:
grades.iloc[1:3, 2:5]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [50]:
grades.loc[['Test2', 'Test3'], ['Sam', 'Katie', 'Bob']]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

In [51]:
grades.iloc[[1, 2], [2, 3, 4]]

       Sam  Katie  Bob
Test2   77     81   65
Test3   90     82   85

**Accessing a Specific DataFrame Cell by Row and Column**

In [52]:
grades.at['Test2', 'Eva']

87

In [53]:
grades.iat[2, 0]

70

**Can assign new values to specific elements**

In [54]:
grades.at['Test2', 'Eva'] = 100

In [55]:
grades.at['Test2', 'Eva']

100

In [56]:
grades.iat[1, 2] = 87

In [57]:
grades.iat[1, 2]

87

**Boolean Indexing**

In [58]:
grades[grades >= 90]

       Wally  Eva   Sam  Katie  Bob
Test1    NaN  100  94.0  100.0  NaN
Test2   96.0  100   NaN    NaN  NaN
Test3    NaN   90  90.0    NaN  NaN

In [59]:
grades[(grades >= 80) & (grades < 90)]

       Wally  Eva   Sam  Katie   Bob
Test1   87.0  NaN   NaN    NaN  83.0
Test2    NaN  NaN  87.0   81.0   NaN
Test3    NaN  NaN   NaN   82.0  85.0

**Descriptive Statistics**

In [60]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   96.666667  90.333333   87.666667  77.666667
std    13.203535    5.773503   3.511885   10.692677  11.015141
min    70.000000   90.000000  87.000000   81.000000  65.000000
25%    78.500000   95.000000  88.500000   81.500000  74.000000
50%    87.000000  100.000000  90.000000   82.000000  83.000000
75%    91.500000  100.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [61]:
pd.set_option('precision', 2)

In [62]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   96.67  90.33   87.67  77.67
std    13.20    5.77   3.51   10.69  11.02
min    70.00   90.00  87.00   81.00  65.00
25%    78.50   95.00  88.50   81.50  74.00
50%    87.00  100.00  90.00   82.00  83.00
75%    91.50  100.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

**Transposing the DataFrame with the T Attribute**

In [63]:
grades.T # shallow copy

       Test1  Test2  Test3
Wally     87     96     70
Eva      100    100     90
Sam       94     87     90
Katie    100     81     82
Bob       83     65     85

In [64]:
grades.T.describe()

        Test1   Test2  Test3
count    5.00    5.00   5.00
mean    92.80   85.80  83.40
std      7.66   13.81   8.23
min     83.00   65.00  70.00
25%     87.00   81.00  82.00
50%     94.00   87.00  85.00
75%    100.00   96.00  90.00
max    100.00  100.00  90.00

In [65]:
grades.T.mean()

Test1    92.8
Test2    85.8
Test3    83.4
dtype: float64

**Sorting Rows by their Indices**

In [66]:
grades2 = grades.sort_index(ascending=False)
grades2

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96  100   87     81   65
Test1     87  100   94    100   83

**Sorting by Column Indices**

In [67]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65  100     81   87     96
Test3   85   90     82   90     70

**Sorting by Column Values**

In [68]:
grades.sort_values(by='Eva', ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96  100   87     81   65
Test3     70   90   90     82   85

In [69]:
grades.sort_values(by='Test1', axis=1, ascending=False)

       Eva  Katie  Sam  Wally  Bob
Test1  100    100   94     87   83
Test2  100     81   87     96   65
Test3   90     82   90     70   85

In [70]:
grades.T.sort_values(by='Test1', ascending=False)

       Test1  Test2  Test3
Eva      100    100     90
Katie    100     81     82
Sam       94     87     90
Wally     87     96     70
Bob       83     65     85

**Copy vs. In-Place Sorting**

In [71]:
grades.sort_values(by='Eva', ascending=False, inplace=True) # change original data right away
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96  100   87     81   65
Test3     70   90   90     82   85

### 2.1 Import csv files

In [77]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [78]:
titanic.head()

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st

In [79]:
titanic.head(10)

                        Unnamed: 0 survived     sex    age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.00            1st
1   Allison, Master. Hudson Trevor      yes    male   0.92            1st
2     Allison, Miss. Helen Loraine       no  female   2.00            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00            1st
5              Anderson, Mr. Harry      yes    male  48.00            1st
6  Andrews, Miss. Kornelia Theodos      yes  female  63.00            1st
7           Andrews, Mr. Thomas Jr       no    male  39.00            1st
8  Appleton, Mrs. Edward Dale (Cha      yes  female  53.00            1st
9          Artagaveytia, Mr. Ramon       no    male  71.00            1st

In [80]:
titanic.tail()

                     Unnamed: 0 survived     sex   age passengerClass
1304       Zabour, Miss. Hileni       no  female  14.5            3rd
1305      Zabour, Miss. Thamine       no  female   NaN            3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5            3rd
1307        Zakarian, Mr. Ortin       no    male  27.0            3rd
1308         Zimmerman, Mr. Leo       no    male  29.0            3rd

In [81]:
titanic.shape

(1309, 5)

### 2.2 Rename columns

In [85]:
titanic.columns = ['Name', 'survived', 'sex', 'age', 'class']

In [86]:
titanic.head()

                              Name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

In [87]:
titanic.rename(columns={'Name': 'name'}, inplace=True)
titanic.head()

                              name survived     sex    age class
0    Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1   Allison, Master. Hudson Trevor      yes    male   0.92   1st
2     Allison, Miss. Helen Loraine       no  female   2.00   1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st

### 2.3 Check column types and info

In [88]:
titanic.dtypes

name         object
survived     object
sex          object
age         float64
class        object
dtype: object

In [89]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      1309 non-null   object
 1   survived  1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   class     1309 non-null   object
dtypes: float64(1), object(4)
memory usage: 51.3+ KB

### 2.4 Check/fill missing values

In [90]:
titanic.isnull()

       name  survived    sex    age  class
0     False     False  False  False  False
1     False     False  False  False  False
2     False     False  False  False  False
3     False     False  False  False  False
4     False     False  False  False  False
...     ...       ...    ...    ...    ...
1304  False     False  False  False  False
1305  False     False  False   True  False
1306  False     False  False  False  False
1307  False     False  False  False  False
1308  False     False  False  False  False

[1309 rows x 5 columns]

In [92]:
titanic.isnull().sum()

name          0
survived      0
sex           0
age         263
class         0
dtype: int64

In [93]:
titanic[titanic.isnull().any(axis=1)].head()

                               name survived     sex  age class
15              Baumann, Mr. John D       no    male  NaN   1st
37   Bradley, Mr. George (George Ar      yes    male  NaN   1st
40        Brewe, Dr. Arthur Jackson       no    male  NaN   1st
46            Cairns, Mr. Alexander       no    male  NaN   1st
59  Cassebeer, Mrs. Henry Arthur Jr      yes  female  NaN   1st

In [94]:
titanic['age'].fillna(-1, inplace=True)
titanic.isnull().sum()

name        0
survived    0
sex         0
age         0
class       0
dtype: int64

### 2.5 Drop missing values

In [97]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/carData/TitanicSurvival.csv')

In [98]:
print(titanic.shape)
titanic.isnull().sum()

(1309, 5)

Unnamed: 0          0
survived            0
sex                 0
age               263
passengerClass      0
dtype: int64

In [99]:
titanic.dropna(inplace=True)
print(titanic.shape)
titanic.isnull().sum()

(1046, 5)

Unnamed: 0        0
survived          0
sex               0
age               0
passengerClass    0
dtype: int64

### 2.6 Simple statistics

In [100]:
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [101]:
titanic['age'].describe()

count    1046.00
mean       29.88
std        14.41
min         0.17
25%        21.00
50%        28.00
75%        39.00
max        80.00
Name: age, dtype: float64

In [103]:
(titanic.survived == 'yes').describe()
# same as (titanic['survived'] == 'yes').describe()

count      1046
unique        2
top       False
freq        619
Name: survived, dtype: object

### 2.7 Import excel files

In [105]:
df = pd.read_excel('Employee_Attrition_Dataset_excel.xlsx')

In [106]:
df.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,...,NumCompaniesWorked,OverTime,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4,...,8,Yes,3,1,8,0,6,4,0,5
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2,...,1,No,4,4,10,3,10,7,1,7
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3,...,6,Yes,3,2,7,3,0,0,0,0
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3,...,1,Yes,3,3,8,3,8,7,3,0
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2,...,9,No,3,4,6,3,2,2,2,2

In [107]:
df.shape

(1470, 22)

### 2.8 Check column names and drop columns

In [108]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'OverTime', 'PerformanceRating',
       'RelationshipSatisfaction', 'TotalWorkingYears',
       'TrainingTimesLastYear', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'],
      dtype='object')

In [109]:
df1 = df[['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education', 'EnvironmentSatisfaction', 'Gender',
          'HourlyRate', 'JobInvolvement', 'JobSatisfaction']]
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

In [110]:
df1 = df.drop(columns=['MaritalStatus', 'MonthlyIncome',
       'NumCompaniesWorked', 'OverTime', 'PerformanceRating',
       'RelationshipSatisfaction', 'TotalWorkingYears',
       'TrainingTimesLastYear', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'])
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

### 2.9 Unique, nunique & value_counts

In [111]:
df1 = df[['Age', 'Attrition', 'BusinessTravel', 'Department', 'Education', 'EnvironmentSatisfaction', 'Gender',
          'HourlyRate', 'JobInvolvement', 'JobSatisfaction']]
df1.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,49,No,Travel_Frequently,Research & Development,1,3,Male,61,2,2
2,37,Yes,Travel_Rarely,Research & Development,2,4,Male,92,2,3
3,33,No,Travel_Frequently,Research & Development,4,4,Female,56,3,3
4,27,No,Travel_Rarely,Research & Development,1,1,Male,40,3,2

In [112]:
df1['BusinessTravel'].unique()

array(['Travel_Rarely', 'Travel_Frequently', 'Non-Travel'], dtype=object)

In [113]:
df1['Department'].unique()

array(['Sales', 'Research & Development', 'Human Resources'], dtype=object)

In [114]:
df1['Department'].nunique()

3

In [115]:
df1['Department'].value_counts()

Research & Development    961
Sales                     446
Human Resources            63
Name: Department, dtype: int64

In [116]:
df1['Department'].value_counts(normalize=True)

Research & Development    0.65
Sales                     0.30
Human Resources           0.04
Name: Department, dtype: float64

### 2.10 Filter, reset index and sort

In [118]:
df2 = df1[df1['Department'] == 'Sales']
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
18,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4
21,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1
27,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2
29,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1

In [119]:
df2 = df1[df1['Department'] == 'Sales'].reset_index(drop=True)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4
1,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4
2,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1
3,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2
4,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1

In [120]:
df_sort = df.sort_values(by = 'Age')
df_sort.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,...,NumCompaniesWorked,OverTime,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
1311,18,No,Non-Travel,Research & Development,3,2,Female,33,3,3,...,1,No,3,3,0,4,0,0,0,0
457,18,Yes,Travel_Frequently,Sales,3,2,Male,69,3,2,...,1,Yes,3,4,0,3,0,0,0,0
972,18,No,Non-Travel,Research & Development,3,4,Female,97,3,4,...,1,No,3,3,0,5,0,0,0,0
301,18,No,Travel_Rarely,Sales,3,4,Female,69,2,3,...,1,No,3,1,0,2,0,0,0,0
296,18,Yes,Travel_Rarely,Research & Development,3,3,Male,54,3,3,...,1,No,3,3,0,2,0,0,0,0

In [121]:
df_sorted = df.sort_values(by=['Education', 'Age'], ascending=[True, False])
df_sorted.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,...,NumCompaniesWorked,OverTime,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
70,59,No,Travel_Frequently,Sales,1,1,Female,57,2,3,...,7,No,3,4,20,2,4,3,1,3
660,58,Yes,Travel_Frequently,Research & Development,1,4,Male,57,2,4,...,9,Yes,3,4,3,3,1,0,0,0
608,55,Yes,Travel_Rarely,Sales,1,3,Male,37,3,4,...,4,No,3,3,12,3,9,7,7,3
774,55,No,Non-Travel,Research & Development,1,3,Male,40,2,1,...,7,No,3,2,31,3,9,7,6,2
787,55,No,Travel_Frequently,Research & Development,1,4,Male,65,3,2,...,3,No,3,2,23,4,3,2,1,2

### 2.11 Map and Replace

In [122]:
d = {'Female': 0, 'Male': 1}
df2['Gender_dummy'] = df2['Gender'].map(d)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy
0,41,Yes,Travel_Rarely,Sales,2,2,Female,94,3,4,0
1,53,No,Travel_Rarely,Sales,4,1,Female,78,2,4,0
2,36,Yes,Travel_Rarely,Sales,4,3,Male,82,2,1,1
3,42,No,Travel_Rarely,Sales,4,3,Male,48,3,2,1
4,46,No,Travel_Rarely,Sales,4,2,Female,83,3,1,0

In [123]:
df2['Department'].replace({'Sales': 'Sales Department'}, inplace=True)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy
0,41,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0
1,53,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0
2,36,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1
3,42,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1
4,46,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0

### 2.12 Column calculation & Lambda function

In [125]:
df2['Overall_Satisfaction'] = df2['EnvironmentSatisfaction'] + df2['JobSatisfaction']
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,41,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,53,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,36,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,42,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,46,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

In [126]:
lambda x: x+3

In [127]:
def add3(x):
    return x + 3

**Lambda with Apply**

In [128]:
df2['Age'] = df2['Age'].apply(lambda x: x + 3)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,44,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,56,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,39,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,45,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,49,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

In [129]:
df2['Age'] = df2['Age'].apply(lambda x: x + 3 if x >= 45 else x + 5)
df2.head()

,Age,Attrition,BusinessTravel,Department,Education,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobSatisfaction,Gender_dummy,Overall_Satisfaction
0,49,Yes,Travel_Rarely,Sales Department,2,2,Female,94,3,4,0,6
1,59,No,Travel_Rarely,Sales Department,4,1,Female,78,2,4,0,5
2,44,Yes,Travel_Rarely,Sales Department,4,3,Male,82,2,1,1,4
3,48,No,Travel_Rarely,Sales Department,4,3,Male,48,3,2,1,5
4,52,No,Travel_Rarely,Sales Department,4,2,Female,83,3,1,0,3

### 2.13 Groupby

In [130]:
df_gb = df[['Department', 'EnvironmentSatisfaction', 
            'HourlyRate', 'JobSatisfaction']].groupby(by=['Department']).mean()
df_gb

                        EnvironmentSatisfaction  HourlyRate  JobSatisfaction
Department
Human Resources                            2.68       64.30             2.60
Research & Development                     2.74       66.17             2.73
Sales                                      2.68       65.52             2.75

### 2.14 Combine tables/datasets

In [131]:
df_1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'Gender': ['F', 'F', 'M', 'F'],
    'Income': [345, 676, 963, 898]}, index=[0, 1, 2, 3])
df_1

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898

In [132]:
df_2 = pd.DataFrame({
    'id': [5, 6, 7],
    'Gender': ['M', 'F', 'M'],
    'Income': [879, 1012, 556]}, index=[0, 1, 2])
df_2

   id Gender  Income
0   5      M     879
1   6      F    1012
2   7      M     556

In [133]:
df_12 = pd.concat([df_1, df_2])
df_12

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898
0   5      M     879
1   6      F    1012
2   7      M     556

### 2.15 Join

In [134]:
df_1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'Gender': ['F', 'F', 'M', 'F'],
    'Income': [345, 676, 963, 898]}, index=[0, 1, 2, 3])
df_1

   id Gender  Income
0   1      F     345
1   2      F     676
2   3      M     963
3   4      F     898

In [135]:
df_3 = pd.DataFrame({
    'id': [1, 2],
    'Age': [23, 45],
    'Job': ['Sales', 'HR']}, index=[0, 1])
df_3

   id  Age    Job
0   1   23  Sales
1   2   45     HR

In [136]:
df_left = df_1.merge(df_3, how='left', on=['id'])
df_left

   id Gender  Income   Age    Job
0   1      F     345  23.0  Sales
1   2      F     676  45.0     HR
2   3      M     963   NaN    NaN
3   4      F     898   NaN    NaN

In [137]:
df_inner = df_1.merge(df_3, how='inner', on=['id'])
df_inner

   id Gender  Income  Age    Job
0   1      F     345   23  Sales
1   2      F     676   45     HR

### 2.16 Save files

In [138]:
titanic.to_csv('titanic_clean.csv', index=False)
df.to_excel('df_clean.xlsx', index=False)